using UnityEngine;

public class EnemyArmyScript : MonoBehaviour
{
    [HideInInspector]
    public float[] OrcsArmy = 
        // гоблины, ночные гоблины, пацаны, пацаны на вепрях, четкие пацаны, четкие пацаны на вепрях, черные орки, тролли, великан, паук арахнорока, бродячий идол, гоблины-лучники, орки-лучники, ночные гоблины-лучники, гоблинская швырялка, катапульта крылатого рока
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };//колво

    [HideInInspector]
    public float[,] enemybattle =
    {

        { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
        { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
        { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

    };
    [HideInInspector]
    public float[,] enemybattleHP =
{

        { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
        { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
        { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

    };
    [HideInInspector] public float[] enemybattleArmyStart = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }; //армия на начало битвы
    [HideInInspector] public float[] enemybattleArmyReserves = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }; //резерв армии

}
