using UnityEngine;

[CreateAssetMenu]
public class ArmyData : ScriptableObject
{

    [HideInInspector]
    public string[] ArmyName =
        { "горняки", "гномьи воины", "гномьи воины тж", "длиннобороды", "длиннобороды тж", "молотобойцы", "железоломы", "мстители",
        "егеря", "забияки", "громобои", "железные ящеры", "пушки", "местеметы", "органные орудия", "огненные пушки"};

    [HideInInspector]
    public float[,] Army =
{ 
        // горняки, гномьи воины, гномьи воины тж, длиннобороды, длиннобороды тж, молотобойцы, железоломы, мстители, егеря, забияки, громобои, железные ящеры, пушки, местеметы, органные орудия, огненные пушки
        {4, 0, 4, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0 },//колво
        {5, 7, 7, 10, 10, 15, 15, 10, 5, 5, 5, 10, 10, 10, 10, 10 },//золото
        {1, 2, 2,  3, 3,  4, 6, 1, 0, 0, 1,   4, 2, 1, 2, 4 },//железо
        {0, 0, 0,  0,  0, 0, 0, 0, 0, 0, 0,   2, 1, 0, 1, 2 },//медь
        {0, 0, 0, 0 ,  0, 0, 0, 0, 1, 1, 1,   2, 2, 4, 2, 4 },//горючие

        };

    [HideInInspector]
    public float[,] ArmyCreate =
    {
        // горняки, гномьи воины, гномьи воины тж, длиннобороды, длиннобороды тж, молотобойцы, железоломы, мстители, егеря, забияки, громобои, железные ящеры, пушки, местеметы, органные орудия, огненные пушки
        {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }, //множитель создания
        {200, 300, 340, 400, 420, 600, 700, 500, 300, 340, 400, 400, 400, 400, 540, 600 }, //золото
        {8,    16,  16,  24, 24,   36,  51,   8,   4,   4,   16, 50,  16,  8,  24,  40 }, //железо
        {0,     0,  0,    0, 0,    0,   4,    0,   0,   0,   4,  12,  4,   0,  8, 16 }, //медь
        {8,     0,  0,    0, 0,    0,   0,    0,   16,  16,   8, 24,  32, 60, 32, 40 }, //горючие
        {100, 100, 100, 80, 80, 80, 60, 80, 80, 80, 80, 28, 60, 60, 60, 60 }, //гномы

        };

    [HideInInspector]
    public float[,] ArmyCharacteristics =
{
        // горняки, гномьи воины, гномьи воины тж, длиннобороды, длиннобороды тж, молотобойцы, железоломы, мстители, егеря, забияки, громобои, железные ящеры, пушки, местеметы, органные орудия, огненные пушки
        {1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 3, 3, 3, 3 },                      //ряд                            0
        {100, 100, 100, 80, 80, 80, 60, 80, 80, 80, 80, 28, 4, 4, 4, 4 },       //численность                    1
        {38,  39,   39, 53, 53, 57, 80, 54, 38, 38, 38, 64, 250, 250, 250, 250 },  //ОЗ на единицу                  2
        {40,  45,   45, 50, 50, 50, 70, 10, 20, 35, 35, 70, 20, 20, 20, 20 },      //броня                          3
        {20,  22,   30, 30, 40, 46, 30, 38, 18, 18, 28, 20, 16, 16, 16, 16 },      //атака в ближнем бою            4
        {18,  40,   30, 48, 40, 35, 68, 32, 26, 28, 28, 27, 20, 20, 20, 20 },      //защита в ближнем бою           5
        {5,   6,    6, 10, 10, 15, 10, 18, 3, 3, 3, 10, 30, 30, 30, 30 },               //сила оружия                    6
        {0,   0,    0, 0, 0, 0, 0, 0, 60, 70, 80, 90, 70, 60, 70, 80 },              //точность в дальнем бою         7
        {0,   0,    0, 0, 0, 0, 0, 0, 5, 6, 10, 50, 400, 300, 500, 750 },            //сила выстрелов                 8

        };
}
