
using UnityEngine;

[CreateAssetMenu]
public class EnemyArmyData : ScriptableObject
{
    [HideInInspector]
    public string[] OrcsArmyName =
        { "гоблины", "ночные гоблины", "пацаны", "пацаны на вепрях", "четкие пацаны", "четкие пацаны на вепрях", "черные орки", "тролли", "великан",
        "паук арахнорока", "бродячий идол", "гоблины-лучники", "орки-лучники", "ночные гоблины-лучники", "гоблинская швырялка", "катапульта крылатого рока"};

    [HideInInspector]
    public float[,] OrcsArmyCharacteristics =
{
        // гоблины, ночные гоблины, пацаны, пацаны на вепрях, четкие пацаны, четкие пацаны на вепрях, черные орки, тролли, великан, паук арахнорока, бродячий идол, гоблины-лучники, орки-лучники, ночные гоблины-лучники, гоблинская швырялка, катапульта крылатого рока
        {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 3, 3 }, //ряд                            0
        {160, 160, 120, 120, 80, 80, 60, 16, 1, 1, 1, 120, 90, 120, 4, 4 }, //численность   1
        {28, 28, 40, 45, 41, 48, 90, 250, 6500, 5000, 8000, 25, 35, 25, 250, 250 }, //ОЗ на единицу                  2
        {10, 7, 15, 30, 25, 40, 60, 20, 15, 60, 80, 5, 5, 5, 5, 5 }, //броня                          3
        {20, 26, 28, 22, 38, 22, 36, 34, 65, 58, 60, 10, 15, 23, 10, 10 }, //атака в ближнем бою            4
        {26, 24, 25, 22, 28, 20, 26, 32, 30, 30, 20, 15, 20, 14, 6, 6 }, //защита в ближнем бою           5
        {3, 4, 6, 8, 10, 12, 18, 80, 1000, 2000, 3000, 2, 3, 3, 30, 30 }, //сила оружия                    6
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 60, 40, 80, 60, 80 }, //точность в дальнем бою         7
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 3, 5, 250, 400 }, //сила выстрелов                 8

        };

    [HideInInspector]
    public float[,] enemyclans =
{
        // гоблины, ночные гоблины, пацаны, пацаны на вепрях, четкие пацаны, четкие пацаны на вепрях, черные орки, тролли,    великан,  паук арахнорока, бродячий идол, гоблины-лучники, орки-лучники, ночные гоблины-лучники, гоблинская швырялка, катапульта крылатого рока
        { 0,            0,              2,          0,              0,              0,                  0.05f,          0.2f,          0.02f,          0,          0,                  0,              0.5f,           0,                      0,              0 },//Ломаные топоры
        { 0.5f,            2,              0,          0,              0.1f,              0,                  0,          0,          0,          0.02f,          0,                  0,              0,              1,                      0.2f,              0 },//Кривой месяц
        { 0,            0.1f,              0,          0,              1,              0,                  0,          0.2f,          0,        0,          0,                  0,              0.5f,           0,                      0,              0.2f },//Кровавые руки
        { 1,            0,              0,          0,              1,              0.1f,                  0,          0,          0,          0,          0.02f,                  0,              0,              0,                      0.1f,              0 },//Костетрясы
        { 0.1f,            2,              2,          0,              0.1f,              0,                  0,          0,          0,          0.02f,        0,                  0,              0,              0,                      0,              0 },//Глазочесы
        { 2,            0,              0,          0,              0,              0,                  0.05f,          0,          0.02f,       0,          0,                  2,              0,              0,                      0,              0 },//Кровавые пыряла
        { 0,            0,              0,          1.5f,              0,           0.5f,                0,          0,          0,          0,          0.02f,                  0,              0,              0,                      0,              0 },//Жубодеры
        { 2,            0.1f,              1,          0,              0,              0,                  0,          0.2f,        0,          0,          0,                  0.5f,              0.5f,              0,                      0,              0 },//Гнилозубы
        { 0,            0.1f,              0,          0.5f,              0,           1,                  0,          0,          0.02f,        0,          0,                  0,              0,              0,                      0,              0 },//Кабанье рыло
        { 1,            1,              0,          0,              0,              0,                  0,          0,          0,          0.05f,        0,                  0.5f,              0,              2,                      0.1f,              0 },//Стреляющие
        { 0.1f,            0.1f,              0,          0,              1,              0.1f,                  0.05f,          0,          0,          0,          0.02f,                  0,              0.5f,              0,                      0,              0 },//Почитающие предков
        { 0,            0,              1,          1,              0.1f,              0,                  0,          0,          0,          0.05f,      0,                  0,              0,              0,                      0,              0 },//Кривая ухмылка
        { 4,            0,              0,          0,              0,              0,                  0,          0.2f,       0.05f,      0,          0,                  0,              0,              0,                      0,              0 },//Троллебои
        { 0.1f,            0.1f,              2,          0,              0,              0.1f,                  0.1f,          0,          0,          0,          0.1f,               0,              1,              0,                      0,              0 },//Зеленый идол
        { 0,            0,              0,          0,              1,              0,                  0.5f,          0.1f,          0.02f,          0,          0.02f,                  0,              0,              1,                      0,              0.2f },//Чоткие ребята гримгора


    };
}
